#Область ПрограммныйИнтерфейс

Функция ТестоваяФункция() Экспорт

КонецФункции

// ФункцияСПараметрами
//	Метод принимающий два параметра и возвращающий их сумму
// Параметры:
//   Параметр1 - Строка - Строковый параметр метода
//   Параметр4 - Массив, Число, Строка - Второй параметр метода
//		Может принимать различные типы
// Возвращаемое значение:
//   Строка - Конкантенация параметров
// Примеры:
//	ФункцияСПараметрами("Привет", ", мир!")
//
Функция ФункцияСПараметрами(Параметр1, Параметр2) Экспорт
	
	Возврат Параметр1 + Параметр2;
	
КонецФункции

// ПроцедураСПараметрами
//	Что-то делает, но не известно что.
// Параметры:
// Параметры:
//   Параметр1
//   Параметр2 - Массив, Число, Строка - Второй параметр метода
//		Может принимать различные типы
//
Процедура ПроцедураСПараметрами(Параметр1, Параметр2) Экспорт

КонецПроцедуры

// ПроцедураСПараметром
//	Что-то делает, но не известно что.
// Параметры:
// Параметры:
//   Параметр1 - Произвольный
//
Процедура ПроцедураСПараметром(Параметр1) Экспорт

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти