#Область ПрограммныйИнтерфейс


// ТестоваяФункция
//		Тестовый метод
//  Возвращаемое значение:
//   Произвольный - описание возвращаемого значения
//
Функция ТестоваяФункция() Экспорт

КонецФункции

// ФункцияСПараметрами
//	Метод принимающий два параметра и возвращающий их сумму
// Параметры:
//   Параметр1 - Строка - Строковый параметр метода
//   Параметр2 - Массив, Число, Строка - Второй параметр метода
//		Может принимать различные типы
// Возвращаемое значение:
//   Строка - Конкантенация параметров
// Примеры:
//	ФункцияСПараметрами("Привет", ", мир!")
//
Функция ФункцияСПараметрами(Параметр1, Параметр2) Экспорт
	
	Возврат Параметр1 + Параметр2;
	
КонецФункции

// ПроцедураСПараметрами
//	Что-то делает, но не известно что.
// Параметры:
// Параметры:
//   Параметр1 - Структура - Набор параметров
//					Ключ1 - Первый ключ
//					Ключ2 - Второй ключ
//					Ключ3 - И третий ключ
//   Параметр2 - Массив, Число, Строка - Второй параметр метода
//		Может принимать различные типы
//
Процедура ПроцедураСПараметрами(Параметр1, Параметр2) Экспорт

КонецПроцедуры

// УстановитьПараметр
// 	Служит примером многострочных описаний параметров
//  Далее по тексту параметр стоит читать как параметр
//
// Параметры:
//	Настройки - НастройкиКомпоновкиДанных, ПользовательскиеНастройкиКомпоновкиДанных,
//		КомпоновщикНастроекКомпоновкиДанных - проверяется кейс когда описание параметров идет в 2 строки
//	Параметр - Строка, ПараметрКомпоновкиДанных - параметр, который требуется установить
//	     но очень длинное описание параметра
//	Значение - Произвольный, 
//				Строка - значение, которое требуется установить
//				Но с длинным описанием
//	Использование - Булево - Проверяется кейс когда запятая в конце не ломает описание параметра,
//	Недоступный - Булево - просто описание
//
// Возвращаемое значение:
//	ЗначениеПараметраНастроекКомпоновкиДанных - установленный параметр настроек КД. Неопределено, если параметр на найден.
//
Функция УстановитьПараметр(Настройки, Параметр, Значение, Использование = Истина, Недоступный = Ложь) Экспорт

	Возврат Настройки;
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти